{"modelTopology": {"keras_version": "2.1.5", "training_config": {"loss_weights": null, "sample_weight_mode": null, "loss": "binary_crossentropy", "metrics": ["acc"], "optimizer_config": {"config": {"decay": 0.0, "epsilon": 1e-07, "rho": 0.8999999761581421, "lr": 9.999999747378752e-05}, "class_name": "RMSprop"}}, "backend": "tensorflow", "model_config": {"config": [{"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_constraint": null, "filters": 32, "kernel_size": [3, 3], "name": "conv2d_1", "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 150, 150, 3], "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 64, "kernel_size": [3, 3], "name": "conv2d_2", "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 128, "kernel_size": [3, 3], "name": "conv2d_3", "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 128, "kernel_size": [3, 3], "name": "conv2d_4", "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_4", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "units": 512}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_2", "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [3, 3, 3, 32], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [3, 3, 64, 128], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_3/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [3, 3, 128, 128], "dtype": "float32", "name": "conv2d_4/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_4/bias"}]}, {"paths": ["group5-shard1of4", "group5-shard2of4", "group5-shard3of4", "group5-shard4of4"], "weights": [{"shape": [6272, 512], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [512], "dtype": "float32", "name": "dense_1/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [512, 1], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [1], "dtype": "float32", "name": "dense_2/bias"}]}]}