{"modelTopology": {"backend": "tensorflow", "keras_version": "2.1.5", "training_config": {"loss": "binary_crossentropy", "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07, "lr": 9.999999747378752e-05}}, "metrics": ["acc"]}, "model_config": {"class_name": "Sequential", "config": [{"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "strides": [1, 1], "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "name": "conv2d_1", "padding": "valid", "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_2", "filters": 64, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_3", "filters": 128, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_4", "filters": 128, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "activation": "sigmoid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}]}}, "weightsManifest": [{"weights": [{"shape": [3, 3, 3, 32], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [3, 3, 32, 64], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_2/bias", "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 128], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv2d_3/bias", "dtype": "float32"}], "paths": ["group3-shard1of1"]}, {"weights": [{"shape": [3, 3, 128, 128], "name": "conv2d_4/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv2d_4/bias", "dtype": "float32"}], "paths": ["group4-shard1of1"]}, {"weights": [{"shape": [6272, 512], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [512], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group5-shard1of4", "group5-shard2of4", "group5-shard3of4", "group5-shard4of4"]}, {"weights": [{"shape": [512, 1], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [1], "name": "dense_2/bias", "dtype": "float32"}], "paths": ["group6-shard1of1"]}]}