{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "mobilenet_1.00_224", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false}}, {"name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [2, 2], "activation": "linear", "bias_regularizer": null, "name": "conv1", "filters": 32, "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv1_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_1", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_1", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_1", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_1_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_1", "filters": 64, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_1_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_2", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [2, 2], "bias_regularizer": null, "name": "conv_dw_2", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_2_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_2", "filters": 128, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_2_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_3", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_3", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_3_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_3", "filters": 128, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_3_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_4", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [2, 2], "bias_regularizer": null, "name": "conv_dw_4", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_4_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_4", "filters": 256, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_4_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_5", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_5", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_5_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_5", "filters": 256, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_5_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_6", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [2, 2], "bias_regularizer": null, "name": "conv_dw_6", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_6_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_6", "filters": 512, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_6_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_7", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_7", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_7_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_7", "filters": 512, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_7_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_8", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_8", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_8_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_8", "filters": 512, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_8_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_9", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_9", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_9_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_9", "filters": 512, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_9_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_10", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_10", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_10_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_10", "filters": 512, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_10_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_11", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_11", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_11_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_11", "filters": 512, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_11_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_12", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [2, 2], "bias_regularizer": null, "name": "conv_dw_12", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_12_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_12", "filters": 1024, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_12_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_13", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pad_13", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"use_bias": false, "strides": [1, 1], "bias_regularizer": null, "name": "conv_dw_13", "padding": "valid", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "depthwise_constraint": null, "activation": "linear", "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_dw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_13_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_pw_13", "filters": 1024, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null, "momentum": 0.99, "name": "conv_pw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_13_relu", "trainable": true, "activation": "relu6"}}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"name": "reshape_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [1, 1, 1024], "trainable": true}}, {"name": "dropout", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.001}}, {"name": "conv_preds", "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "name": "conv_preds", "filters": 1000, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"name": "act_softmax", "inbound_nodes": [[["conv_preds", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "act_softmax", "trainable": true, "activation": "softmax"}}, {"name": "reshape_2", "inbound_nodes": [[["act_softmax", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_2", "target_shape": [1000], "trainable": true}}], "output_layers": [["reshape_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, "keras_version": "2.1.5"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_variance", "dtype": "float32", "shape": [32]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv_dw_1/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv_dw_10/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv_dw_10_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/moving_variance", "dtype": "float32", "shape": [512]}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv_dw_11/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv_dw_11_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/moving_variance", "dtype": "float32", "shape": [512]}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv_dw_12/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv_dw_12_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/moving_variance", "dtype": "float32", "shape": [512]}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv_dw_13/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 1024, 1]}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv_dw_13_bn/gamma", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/beta", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/moving_variance", "dtype": "float32", "shape": [1024]}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "conv_dw_1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/moving_variance", "dtype": "float32", "shape": [32]}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv_dw_2/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv_dw_2_bn/gamma", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/beta", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/moving_variance", "dtype": "float32", "shape": [64]}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv_dw_3/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv_dw_3_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/moving_variance", "dtype": "float32", "shape": [128]}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv_dw_4/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv_dw_4_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/moving_variance", "dtype": "float32", "shape": [128]}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv_dw_5/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 256, 1]}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv_dw_5_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/moving_variance", "dtype": "float32", "shape": [256]}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv_dw_6/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 256, 1]}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv_dw_6_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/moving_variance", "dtype": "float32", "shape": [256]}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv_dw_7/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv_dw_7_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/beta", "dtype": "float32", "shape": 