{"modelTopology": {"backend": "tensorflow", "model_config": {"config": {"name": "vgg16", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "block1_conv1", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block1_conv1", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_conv2", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block1_conv2", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_pool", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "block1_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block2_conv1", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_conv2", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block2_conv2", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_pool", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "block2_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block3_conv1", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block3_conv1", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv2", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block3_conv2", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv3", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block3_conv3", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_pool", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "block3_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block4_conv1", "activity_regularizer": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv2", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block4_conv2", "activity_regularizer": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv3", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block4_conv3", "activity_regularizer": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_pool", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "block4_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block5_conv1", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block5_conv1", "activity_regularizer": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv2", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block5_conv2", "activity_regularizer": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv3", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "name": "block5_conv3", "activity_regularizer": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_pool", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "block5_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "fc1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "fc1", "kernel_constraint": null, "units": 4096, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense"}, {"name": "fc2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "fc2", "kernel_constraint": null, "units": 4096, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "predictions", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "predictions", "kernel_constraint": null, "units": 1000, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model"}, "keras_version": "2.1.5"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "block1_conv1/kernel", "dtype": "float32", "shape": [3, 3, 3, 64]}, {"name": "block1_conv1/bias", "dtype": "float32", "shape": [64]}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "block1_conv2/kernel", "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "block1_conv2/bias", "dtype": "float32", "shape": [64]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "block2_conv1/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "block2_conv1/bias", "dtype": "float32", "shape": [128]}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "block2_conv2/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "block2_conv2/bias", "dtype": "float32", "shape": [128]}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "block3_conv1/kernel", "dtype": "float32", "shape": [3, 3, 128, 256]}, {"name": "block3_conv1/bias", "dtype": "float32", "shape": [256]}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "block3_conv2/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "block3_conv2/bias", "dtype": "float32", "shape": [256]}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "block3_conv3/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "block3_conv3/bias", "dtype": "float32", "shape": [256]}]}, {"paths": ["group8-shard1of2", "group8-shard2of2"], "weights": [{"name": "block4_conv1/kernel", "dtype": "float32", "shape": [3, 3, 256, 512]}, {"name": "block4_conv1/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group9-shard1of3", "group9-shard2of3", "group9-shard3of3"], "weights": [{"name": "block4_conv2/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block4_conv2/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group10-shard1of3", "group10-shard2of3", "group10-shard3of3"], "weights": [{"name": "block4_conv3/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block4_conv3/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group11-shard1of3", "group11-shard2of3", "group11-shard3of3"], "weights": [{"name": "block5_conv1/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block5_conv1/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group12-shard1of3", "group12-shard2of3", "group12-shard3of3"], "weights": [{"name": "block5_conv2/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block5_conv2/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group13-shard1of3", "group13-shard2of3", "group13-shard3of3"], "weights": [{"name": "block5_conv3/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "block5_conv3/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group14-shard1of99", "group14-shard2of99", "group14-shard3of99", "group14-shard4of99", "group14-shard5of99", "group14-shard6of99", "group14-shard7of99", "group14-shard8of99", "group14-shard9of99", "group14-shard10of99", "group14-shard11of99", "group14-shard12of99", "group14-shard13of99", "group14-shard14of99", "group14-shard15of99", "group14-shard16of99", "group14-shard17of99", "group14-shard18of99", "group14-shard19of99", "group14-shard20of99", "group14-shard21of99", "group14-shard22of99", "group14-shard23of99", "group14-shard24of99", "group14-shard25of99", "group14-shard26of99", "group14-shard27of99", "group14-shard28of99", "group14-shard29of99", "group14-shard30of99", "group14-shard31of99", "group14-shard32of99", "group14-shard33of99", "group14-shard34of99", "group14-shard35of99", "group14-shard36of99", "group14-shard37of99", "group14-shard38of99", "group14-shard39of99", "group14-shard40of99", "group14-shard41of99", "group14-shard42of99", "group14-shard43of99", "group14-shard44of99", "group14-shard45of99", "group14-shard46of99", "group14-shard47of99", "group14-shard48of99", "group14-shard49of99", "group14-shard50of99", "group14-shard51of99", "group14-shard52of99", "group14-shard53of99", "group14-shard54of99", "group14-shard55of99", "group14-shard56of99", "group14-shard57of99", "group14-shard58of99", "group14-shard59of99", "group14-shard60of99", "group14-shard61of99", "group14-shard62of99", "group14-shard63of99", "group14-shard64of99", "group14-shard65of99", "group14-shard66of99", "group14-shard67of99", "group14-shard68of99", "group14-shard69of99", "group14-shard70of99", "group14-shard71of99", "group14-shard72of99", "group14-shard73of99", "group14-shard74of99", "group14-shard75of99", "group14-shard76of99", "group14-shard77of99", "group14-shard78of99", "group14-shard79of99", "group14-shard80of99", "group14-shard81of99", "group14-shard82of99", "group14-shard83of99", "group14-shard84of99", "group14-shard85of99", "group14-shard86of99", "group14-shard87of99", "group14-shard88of99", "group14-shard89of99", "group14-shard90of99", "group14-shard91of99", "group14-shard92of99", "group14-shard93of99", "group14-shard94of99", "group14-shard95of99", "group14-shard96of99", "group14-shard97of99", "group14-shard98of99", "group14-shard99of99"], "weights": [{"name": "fc1/kernel", "dtype": "float32", "shape": [25088, 4096]}, {"name": "fc1/bias", "dtype": "float32", "shape": [4096]}]}, {"paths": ["group15-shard1of17", "group15-shard2of17", "group15-shard3of17", "group15-shard4of17", "group15-shard5of17", "group15-shard6of17", "group15-shard7of17", "group15-shard8of17", "group15-shard9of17", "group15-shard10of17", "group15-shard11of17", "group15-shard12of17", "group15-shard13of17", "group15-shard14of17", "group15-shard15of17", "group15-shard16of17", "group15-shard17of17"], "weights": [{"name": "fc2/kernel", "dtype": "float32", "shape": [4096, 4096]}, {"name": "fc2/bias", "dtype": "float32", "shape": [4096]}]}, {"paths": ["group16-shard1of4", "group16-shard2of4", "group16-shard3of4", "group16-shard4of4"], "weights": [{"name": "predictions/kernel", "dtype": "float32", "shape": [4096, 1000]}, {"name": "predictions/bias", "dtype": "float32", "shape": [1000]}]}]}