{"modelTopology": {"backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "metrics": ["acc"], "optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "epsilon": 1e-07}, "class_name": "Adam"}, "loss_weights": null, "sample_weight_mode": null}, "model_config": {"config": [{"config": {"kernel_regularizer": null, "dtype": "float32", "use_bias": true, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "name": "conv2d_1", "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "name": "conv2d_2", "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "name": "conv2d_3", "filters": 128, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "name": "conv2d_4", "filters": 128, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "units": 512, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 10, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.5"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_3/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}]}, {"paths": ["group5-shard1of2", "group5-shard2of2"], "weights": [{"dtype": "float32", "shape": [2048, 512], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_1/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [512, 10], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_2/bias"}]}]}