{"modelTopology": {"backend": "tensorflow", "training_config": {"metrics": ["acc"], "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513, "amsgrad": false}}, "loss": "categorical_crossentropy"}, "keras_version": "2.1.5", "model_config": {"class_name": "Sequential", "config": [{"config": {"strides": [1, 1], "activation": "relu", "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dtype": "float32", "filters": 32, "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 100, 3], "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "units": 512, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "units": 10, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}]}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [3, 3, 3, 32], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [3, 3, 64, 128], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_3/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [3, 3, 128, 128], "dtype": "float32", "name": "conv2d_4/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_4/bias"}]}, {"paths": ["group5-shard1of2", "group5-shard2of2"], "weights": [{"shape": [2048, 512], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [512], "dtype": "float32", "name": "dense_1/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [512, 10], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [10], "dtype": "float32", "name": "dense_2/bias"}]}]}