{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [3, 3, 3, 32], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_1/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [3, 3, 32, 64], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_2/bias", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [3, 3, 64, 128], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv2d_3/bias", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [3, 3, 128, 128], "name": "conv2d_4/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv2d_4/bias", "dtype": "float32"}]}, {"paths": ["group5-shard1of2", "group5-shard2of2"], "weights": [{"shape": [2048, 512], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [512], "name": "dense_1/bias", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [512, 10], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_2/bias", "dtype": "float32"}]}], "modelTopology": {"model_config": {"config": [{"config": {"data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dtype": "float32", "activity_regularizer": null, "activation": "relu", "trainable": true, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "name": "conv2d_1", "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "valid", "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "valid", "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "valid", "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "units": 512, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "trainable": true, "units": 10, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null, "metrics": ["acc"], "optimizer_config": {"config": {"epsilon": 1e-07, "decay": 0.0, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "amsgrad": false}, "class_name": "Adam"}}, "backend": "tensorflow", "keras_version": "2.1.5"}}